package org.college.np1;

import java.util.Scanner;
import java.security.SecureRandom;
public class Main {

    static String playerInput;
    static String hiddenWord;

    public static final String ANSI_RESET = "\u001B[0m";
    public static final String ANSI_YELLOW = "\u001B[33m";
    public static final String ANSI_GREEN = "\u001B[32m";

    public static void main() {


        Scanner sc = new Scanner(System.in);

        System.out.println("Меню гри:");
        System.out.printf("Виберіть кількість гравців: \n // 1 гравець \n // 2 гравця \n");

        int turnplayer = sc.nextInt();

        sc.nextLine();


        if (turnplayer == 1) {
            System.out.println("Ви вибрали режим на одного гравця");
            turnLevel();
        } else if (turnplayer == 2) {
            System.out.println("Ви вибрали режим на два гравця");
            hiddenWord = usersInput();

        }


        System.out.printf("У вас є 6 спроб \n Напишіть слово, яке на вашу думку загаданеНапишіть слово, яке на вашу думку загадане \n");

        for (int i = 0; i < 6; i++) {
            playerInput();
            if (PrintWordColor(playerInput.toCharArray(), hiddenWord.toCharArray())) {
                System.out.printf("Ви виграли! \n Бажаєте пчати нову гру ? \n");

                newGame();

                return;
            }
        }

        System.out.println("Ви програли. Слово було: " + hiddenWord);

    }

    public static void turnLevel() {

        Scanner sc = new Scanner(System.in);

        SecureRandom random = new SecureRandom();

        boolean one = false; // lvl 1
        boolean two = false;// lvl 2
        boolean three = false;// lvl 3

        System.out.printf("Виберить веберіть складність: \n ** 1 level \n ** 2 level \n ** 3 level \n");
        int usersTurn = sc.nextInt(); // выбор уровня сложности


        do {
            if (usersTurn == 1) {
                one = true;
                break;
            } else if (usersTurn == 2) {
                two = true;
                break;
            } else if (usersTurn == 3) {
                three = true;
                break;
            } else {
                System.out.println("Помилка. Здійсніть спробу ще раз");
            }
        }
        while (true);

        String[] words = null;


        // выбор слова компьютером

        if (one == true) {
            String list1 = "АРЕНА БАЗАР БАЛЕТ БАНКА БАРАН БАТОН БЕРЕГ БІРКА БОКАЛ БОНУС БОЧКА БРАВО БРАМА БРОВА БУДКА БУКЕТ БУЛКА БУРАН ВАГОН ВАХТА ВЕСНА ВЕСЛО ВІДЕО ВІЗОК ВІЙНА ВІКНО ВІЛЛА ВІНИК ВІЗИТ ВІРУС ВІТЕР ВЛАДА ВОКАЛ ВОРОН ВОРОГ ВСТУП ВЧОРА ГАРАЖ ГЛИНА ГЛУЗД ГОЛОС ГОЛЬФ ГОНОР ГОРОД ГОРОХ ГРОЗА ГРУПА ГРУДИ ГУМОР ГУСАК ДАМБА ДВЕРІ ДЕКОР ДЕКАН ДЕСНА ДИВАН ДИКИЙ ДИМАР ДІРКА ДІЖКА ДОКАЗ ДОГМА ДОНОР ДОШКА ДРАКА ДРОВА ДУМКА ДУПЛО ДУРАК ДУЖИЙ ДУШНО ЕКРАН ЕМАЛЬ ЕПОХА ЕТИКА ЕФІР ЖАРКО ЖЕСТИ ЖИВІТ ЖИВИЙ ЖІНКА ЖОВТА ЖОРНА ЖУПАН ЗАВОД ЗАГІН ЗАДУМ ЗАКАЗ ЗАКИД ЗАЛИВ ЗАМОК ЗАМІР ЗАПАС ЗАПАХ ЗАПИС ЗАРАЗ ЗАРЯД ЗАСУВ ЗАТОР ЗАЯВА ЗБРОЯ ЗВУКИ ЗЕБРА ЗЕМЛЯ ЗІРКА ЗМІНА ЗНАКИ ЗРАДА ЗРІСТ ЗСУВИ ІКОНА ІМІДЖ ІМЕНА КАБАН КАЗАН КАЗКА КАНАЛ КАНАТ КАНОН КАРТИ КАСКА КАТЕР КАЧКА КВІТИ КЕРМО КИЛИМ КИРКА КИТАЙ КІШКА КЛІПИ КЛОУН КЛУБИ КНИГА КОБЗА КОЗАК КОЗЕЛ КОЗИР КОКОС КОЛІЯ КОЛОС КОМАР КОМІК КОМІР КОНУС КОПАЧ КОПІЯ КОРОБ КОРОК КОСАР КОТЕЛ КОФТА КРАМА КРАСА КРИЗА КРИК КРИЛО КРУГИ КРУПА КУЗОВ КУЛАК КУМИР КУПОЛ КУСОК КУХНЯ ЛАМПА ЛАПКА ЛАСКА ЛЕГКО ЛЕДАР ЛЕПЕТ ЛИМАН ЛИМОН ЛИПКА ЛІКАР ЛІЛІЯ ЛІНІЯ ЛІЖКО ЛІТАК ЛОГІН ЛОДКА ЛОЖКА ЛОПУХ ЛОТОС ЛОТОК ЛУСКА ЛЮБОВ МАВПА МАГІЯ МАЗУТ МАЛЯР МАЛЮК МАНІЯ МАРКА МАРНО МАСКА МАСЛО МАФІЯ МЕБЛІ МЕДАЛЬ МЕТАН МІТЛА МЕТРО МИРНА МИСКА МИШКА МІЗЕР МІЗКИ МІСЦЕ МІСТО МІТКА МІЦНО МЛИН МОЗОК МОКРА МОЛОТ МОНАХ МОРДА МОРОЗ МОСТИ МОТИВ МОРКВА МОРЯК МУЗЕЙ МУЗИКА МУЛЯЖ МУЛЯР МУМІЯ МУФТА НАБІР НАВИК НАГАН НАДІЯ НАЗАД НАЗВА НАКАТ НАКИД НАКАЗ НАМІР НАПАД НАПІЙ НАПИС НАРОД НАСОС НАУКА НАФТА НАХИЛ НАЦІЯ НЕВОД НЕЛАД НЕРВИ НИЖНЯ НИЗКА НИТКА НІМФА НІЧКА НОВИЙ НОВИК НОЖКА НОМЕР НОРМА НОСКИ НОСИК НОСОК НОТКА ОБМІН ОБРАЗ ОБРІЙ ОБРОК ОБСЯГ ОВОЧІ ОГЛЯД ОДЕЖА ОДИН ОЗЕРО ОКЕАН ОКРАС ОКУНЬ ОЛИВА ОЛОВО ОЛЕНЬ ОПЕРА ОПІКА ОПОРА ОРГАН ОРДЕН ОРЕЛ ОСІНЬ ОСТРІВ ОТВІР ОТАРА ОФІСИ ОЦІНКА";
            words = list1.trim().split(" ");
        } else if (two == true) {
            String list2 = "АБРИС АБЗАЦ АВРАЛ АГЕНТ АДЕПТ АЗИМУТ АКОРД АКТОР АКУЛА АЛІБІ АЛМАЗ АМЕБА АНOНС АОРТА АСПЕКТ АРХІВ АТЛАС АТЛЕТ БАГАЖ БАЙКА БАЛАНС БАЛКА БАЛОН БАРАК БАРІЙ БАРИТ БАРОК БАРОН БАТІГ БЕКАС БЕТОН БИДЛО БИТВА БІРЖА БІСЕР БЛАНК БЛЕФ БЛИСК БЛОХА БЛЮДО БОЄЦЬ БОНУС БРОВА БРОНЬ БРЮКИ БУЛАТ БУХТА ВАКУУМ ВАЛЬС ВАРТА ВИБІР ВИГУК ВИМІР ВИРАЗ ВИСОК ВИХОР ВИШКА ВІВЦЯ ВІДБІР ВІДГУК ВІДСІЧ ВІЗИР ВКЛАД ВПЛИВ ВСТУП ВУЗОЛ ВУШКО ВИХІД ВИРОК ГАММА ГІДНА ГНІЗДО ГОНОР ГРАНЬ ГРИФ ГРОНО ГРЯДА ГРИЖА ДАННЯ ДЕКОР ДЕЛЬТА ДЕМОН ДЕСНА ДЕФІС ДИНАР ДИШЛО ДОГМА ДОЗОР ДОКІР ДОПИС ДОСВІД ДОСЬЄ ДОТИК ДОХІД ДРАЖЕ ДРЕЛЬ ДРЕЙФ ДУЕЛЬ ДУКАТ ДУПЛО ЕКРАН ЕКЗИТ ЕМАЛЬ ЕПОХА ЕТИКА ЕФЕКТ ЕФІР ЖАРТИ ЖЕТОН ЖИВЛО ЖИТЛО ЖНИВА ЖОКЕЙ ЗАВАЛ ЗАДОР ЗАЗОР ЗАКИД ЗАМІР ЗАМША ЗАНОС ЗАПИТ ЗАРИВ ЗАРЯД ЗАСОВ ЗАСУХА ЗАТИШ ЗАТОР ЗАЧИТ ЗАЯВА ЗБІРКА ЗВАБА ЗВИВИ ЗГОДА ЗДВИГ ЗЕФІР ЗІРКА ЗЛАКИ ЗМІНА ЗМІСТ ЗРАЗОК ЗРІСТ ЗУСИЛ ІДЕАЛ ІДІОТ ІКОНА ІМІДЖ ІМПОРТ ІНЖИР ІСПИТ ІСКРА ІТЕРА КАЗУС КАКАО КАЛАЧ КАМІН КАНОН КАРАТ КАРМА КАСТА КАТОД КВАРЦ КВОТА КЕГЛЯ КЕЛИХ КИВОК КИСЕТ КИСТЬ КИШКА КІВЕР КІЛОК КІОСК КІСТА КЛІШЕ КЛУНЯ КЛЯСА КЛЯМКА КОЖУХ КОКОН КОЛАЖ КОЛОС КОЛЬЄ КОЛЬТ КОМИН КОМІР КОМУНА КОНИК КОНУС КОПІЯ КОПУН КОРАН КОРБА КОРУП КОСАК КОСИЙ КОСАР КОТЕЛ КОШИК КРАФТ КРЕДО КРИЗА КРИЦЯ КРОНА КРУПА КУЗОВ КУКІЛЬ КУЛОН КУМИР КУПЕЦЬ КУПОЛ КУРГАН КУРТА КУТИК КУЧЕР ЛАВАШ ЛАВКА ЛАДНА ЛАНКА ЛАТЕКС ЛАТИШ ЛАТКИ ЛЕГІТ ЛЕДАР ЛЕПЕТ ЛИМОН ЛИМАН ЛИХВА ЛИЦАР ЛІРИК ЛІТРА ЛОГІКА ЛОКУС ЛОПУХ ЛОТОС ЛОТОК ЛУНКА ЛУСКА ЛЮЛЬКА ЛЯПАС МАГМА МАЗУТ МАКЕТ МАЛЯР МАНІЯ МАНЕЖ МАНКА МАНТО МАРКА МАСИВ МАСТЬ МАФІЯ МЕДІА МЕТАН МЕТИЗ МЕТРО МИТАР МИТТЯ МІЗЕР МІНУС МІРКА МОДЕМ МОДУС МОДУЛЬ МОТИВ МУЛЯЖ МУЛЯР МУМІЯ МУФТА НАБІР";
            words = list2.trim().split(" ");
        } else if (three == true) {
            String list3 = "АБРЕК БАГВА БАКАН БАЛОК БАРДА БАШЛИ БЕРЛО БЕРЦЕ БОДНЯ БОРЕЙ БОРНЯ БРИЛА БРИНЬ БРИЦЯ БРОВА БРУСИ БРИЛЬ БУКАТ БУКВА БУКША БУЛАТ БУСОЛ БУТОН БУТТЯ БУХТА БУЧНЕ БУШЛА БЮВАР БЮРЕТ ВАГРА ВАЙДА ВАКАР ВАЛОК ВАЛУН ВАПНО ВАРТА ВАТКА ВАТРА ВДАЧА ВЕЛЕТ ВЕЛЮР ВЕРБА ВЕРПА ВЕРНИ ВЕРСА ВЕРСТ ВЕРХИ ВЕРША ВИРВА ВИРІЙ ВИСОК ВИТЯГ ВІЧКО ВЛАСЯ ВОЛАН ВОЛОТ ВРОДА ВУЙКО ВУШКО ГАВРА ГАЗДА ГАЛАС ГАЛУЗ ГАМАН ГАМУЗ ГАРУС ГВАЛТ ГЕДЗЬ ГЕРЕГ ГЕРЦЬ ГИЛЛЯ ГІРКА ГІСТЬ ГЛАВА ГЛЕЙ ГЛИВА ГЛЯКА ГНІДА ГНОТИ ГОМИН ГОНТИ ГОРЯК ГРАДА ГРИВА ГРОНО ГРОШІ ГРУДИ ГРЯДА ГУЖВА ГУЛЯШ ДАРАК ДЕБІТ ДЗВІН ДЗЮБ ДИШЛО ДНЕСЬ ДРАГА ДРАЖЕ ДРАНА ДРИГИ ДУКАТ ДУПЕЛ ДУТТЯ ДЮЖИЙ ЕКЗЕМ ЕКЛЕР ЕЛЮАТ ЕПІДА ЕПОДИ ЕРАТІ ЕСПРИ ЖАБУНЬ ЖВАЛО ЖЕРЛО ЖИВЛО ЖНИВА ЖОРНА ЖУПАН ЗАБІЙ ЗАГОН ЗАКЛАД ЗАКУТ ЗАЛОМ ЗАМАХ ЗАМИН ЗАМША ЗАПАД ЗАРОД ЗАСІВ ЗАСОВ ЗАСТУП ЗАСУХА ЗАТОН ЗАТИК ЗВАБА ЗГАДКА ЗИПУН ЗОЛОВ ЗУБИЛО ЗЯБЛИ ІБИСИ ІВРИТ ІЗВОД ІКОТА ІЛЕУС ІМАГО ІМБИР ІНДРИ ІНТЕЛ ІПРИТ ІРИДА КАГАТ КАДІБ КАЗАН КАЗЯК КАЛАМ КАЛИМ КАПТУР КАРБИ КАРИЙ КАРСТ КАРЮК КАТІВ КАТМА КАШНЕ КВЕДА КВИДЛ КВОЛА КИРПА КИСЕТ КИЧКА КОБЗА КОВБИК КРАСА КРИЦЯ КРЯЖ КУРАЖ КУХТА ЛАДАН ЛАДВО ЛАКЕЙ ЛАМУТ ЛАПИК ЛАПТА ЛЕГІТ ЛИМАР ЛИНВА ЛИТВА ЛОЦІЯ ЛУБНИ ЛУДИК ЛУНКА ЛУТКА ЛЮШНЯ ЛЯПАС МАЛЯР МАНТО МАЦАК МИГДА МИРРА МІХУР МРЯКА МУЛЯЖ МУРЛО МУСІЙ НАБІЙ НАВАЛ НАВКІЛ НАМИЛ НАПІВ НАРДА НАРТИ НАСИП НАХТІ НАФТА НАЦРІ НЕЗДА НЕЛЮБ НЕМАХ НЕРПА НЕУКИ НИВКА НОСАР НОСАК НОЧВИ НЮХТІ ОБРОК ОВИД ОГЛАВ ОГРІЙ ОГУДА ОКІЛ ОКРАЙ ОКУТА ОПУКА ОРЧИК ОСАДА ОСКАЛ ОТАР ОТТАК ОФІРА ОХВАТ ОЧЕП ОЧКУР ПАДЛО ПАЗУХ ПАЙКА ПАКІЛ ПАКЛЯ ПАЛАС ПАЛІЙ ПАНІВ ПАНІЧ ПАНОК ПАПЛЮ ПАРДО ПАРСУ ПАРТИ ПАРУБ";
            words = list3.trim().split(" ");
        }

        int randomIndex = random.nextInt(words.length);

        hiddenWord = words[random.nextInt(words.length)];

        System.out.println("Комп'ютер загадав слово");
        System.out.println("*****");

    }

    public static String usersInput() {

        Scanner sc = new Scanner(System.in);

        System.out.println("Хтось з вас загадує слоово. (НЕ ПІДГЛЯДАТИ!!!!!)");

        String input;

        // проверка на праивльность длины слова
        do {
            input = sc.nextLine().toUpperCase();

            if (input.length() < 5) {
                System.out.println("Ви ввели слово менше п'яти символів. Будь ласка, спробуйте ще раз...");
            } else if (input.length() > 5) {
                System.out.println("Ви ввели слово більше п'яти символів. Будь ласка, спробуйте ще раз...");
            } else if (input.matches(".*\\d.*")) {
                System.out.println("Помилка: у слові є цифра! Спробуйте ще раз...");
            } else {
                break;
            }
        }
        while (true);


// цикл который кодирует слово загадоное
        for (int f = 0; f < 10; f++) {
            System.out.println(" ");
        }
        System.out.println();



        System.out.println("Слово загадане, та приховане");
        System.out.println("*****");


        return input;
    }

    public static void playerInput() {

        Scanner sc = new Scanner(System.in);

        System.out.println("Напишіть слово, яке на вашу думку загадане:");

        int attemptsLeft = 6;

        // проверка на праивльность длины слова
        do {
            playerInput = sc.nextLine().toUpperCase();

            if (playerInput.length() < 5) {
                System.out.println("Ви ввели слово менше п'яти символів. Будь ласка, спробуйте ще раз...");
            } else if (playerInput.length() > 5) {
                System.out.println("Ви ввели слово більше п'яти символів. Будь ласка, спробуйте ще раз...");
            } else if (playerInput.matches(".*\\d.*")) {
                System.out.println("Помилка: у слові є цифра! Спробуйте ще раз...");
            } else {
                attemptsLeft--;
                System.out.println("У вас залишилось " + attemptsLeft + " спроб");
                break;
            }
        }
        while (true);

        //счетчик попыток
        if (attemptsLeft > 6) {
            System.out.printf("❌ Ви використали всі 6 спроб \n Бажаєте пчати нову гру ? \n");

            newGame();
        }

    }

    public static boolean PrintWordColor(char[] inputWord, char[] correctWord) {

        boolean correct = true;
        char[] answer = correctWord.clone();
        int[] colorLetter = new int[5];

        for (int i = 0; i < 5; i++) {
            if (inputWord[i] == answer[i]) {
                colorLetter[i] = 2;
                answer[i] = ' ';
            } else {
                correct = false;
            }
        }

        for (int i = 0; i < 5; i++) {
            if (colorLetter[i] == 0) {
                for (int j = 0; j < 5; j++) {
                    if (inputWord[i] == answer[j]) {
                        colorLetter[i] = 1;
                        answer[j] = ' ';
                        break;
                    }
                }
            }
        }

        for (int i = 0; i < 5; i++) {
            if (colorLetter[i] == 2) {
                System.out.print(ANSI_GREEN + inputWord[i] + ANSI_RESET);
            } else if (colorLetter[i] == 1) {
                System.out.print(ANSI_YELLOW + inputWord[i] + ANSI_RESET);
            } else {
                System.out.print(inputWord[i]);
            }
        }
        System.out.println();

        return correct;
    }

    public static String getAnswer() {

        Scanner sc = new Scanner(System.in);
        String answer = sc.next().toUpperCase();;

        sc.nextLine();
        return answer;
    }

    public static void newGame() {
        String answer = getAnswer();

        while (true) {
            if (answer.equals("ТАК") || answer.equals("ДА")) {
                main();
                break;
            }
            else if (answer.equals("НЕТ") || answer.equals("НІ")) {
                System.out.printf("Дякую, що зіграли у нашу гру!☺\uFE0F \n Автори: leshka, fr1zi");
                break;
            }
            else {
                System.out.println("Ви ввели не логічну відповідь. Спробуйте, будь ласка, ще раз...");
            }
        }

    }

}